Revit 2027 API
NumberingSchema.GetNumberingSchema(Document, NumberingSchemaType) Method
Note: This API is now obsolete.
 Returns an instance of the specified Numbering Schema in the given document.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
[ObsoleteAttribute("This method is deprecated in Revit 2027 and may be removed in a later version of Revit. See the overload of this function that uses schema name as input.")]
public static NumberingSchema GetNumberingSchema(
	Document document,
	NumberingSchemaType schemaType
)
<ObsoleteAttribute("This method is deprecated in Revit 2027 and may be removed in a later version of Revit. See the overload of this function that uses schema name as input.")>
Public Shared Function GetNumberingSchema (
	document As Document,
	schemaType As NumberingSchemaType
) As NumberingSchema
public:
[ObsoleteAttribute(L"This method is deprecated in Revit 2027 and may be removed in a later version of Revit. See the overload of this function that uses schema name as input.")]
static NumberingSchema^ GetNumberingSchema(
	Document^ document,
	NumberingSchemaType^ schemaType
)
[<ObsoleteAttribute("This method is deprecated in Revit 2027 and may be removed in a later version of Revit. See the overload of this function that uses schema name as input.")>]
static member GetNumberingSchema :
        document : Document *
        schemaType : NumberingSchemaType -> NumberingSchema
Parameters
document Document
 A document to get the numbering schema from.
schemaType NumberingSchemaType
 The type of a built-in schema to get.
Return Value
NumberingSchema
 Instance of the specified schema.
Exceptions
Exception | Condition
ArgumentException |  The given schemaType has an invalid Id.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
NumberingSchema Class
GetNumberingSchema Overload
Autodesk.Revit.DB Namespace